import { Card, Player } from '@prisma/client';

export class TelegramMessages {
  static getStartMessage(playerData: Player) {
    const { score_all_time, score_season } = playerData;

    return `
✊ Приветствую тебя в нашем последнем оплоте человечества! После первого ядерного удара мы отправились на Индонезийский остром <i>Суматра</i>, на котором расположено озеро <i>Тоба</i>. На этом озере <i>Тоба</i> есть остром <b>Самосир</b>. На него ты и прибыл, как наш <i>великий вождь</i> и приказал. Мы ждали тебя, новичок. Мы уже успели организовать здесь поселение. Я тебе сейчас все расскажу

💎 В нашей деревне большинство мужчины, только они смогли спастить после первых ядерных атак, остальной мир в руинах. Мы приверженцы мужского государства, поэтому ты будешь зарабатывать уважение среди нас, новичок. Сейчас ты просто <i>омежка</i>, но позже сможешь стать истинным <i>альфой</i>! Для этоо тебе надо собирать коллекционные карты, ты можешь ими обмениваться с другими жителями нашего великого поселения, но я бы рекомендовал тебе сражаться за них, так получишь сразу все: и свое, и чужое. Заглядывай почаще в <i>лютеранскую церковь</i> "GEREJA HKBP BOLON PANGURURAN", это наше священное место, ведь великий вождь именно напротив нее на холме ждал первым выживших, чтобы основать поселение. В ней тебе ждет множество сюрпризов, которые в обычной жизни ты точно не видел! 

🐘 Вроде все... Хотя забыл! Ручные слоны охраняют многие места на Самосире, доступ к ним имеется только у тех, кто оформил <b>Поздняков Pass</b>. С ним ты можешь основать свой клан и начать великий путь рода, тебе будет доступно больше бросков костей, перерыв между бесплатными открытиями карт снизиться с 4 часов на 3, а еще множество чудес на холме и в лютеранской церкви станут доступны для тебя. С Поздняков Pass тебе не будут страшны даже слоновые акулы, ведь в тебе будет больше тестестерона, они будут бояться

💪 Теперь все! Дерзай, новичок. Тебе открыт совершенно новый мир после пост-ядерного апокалипсиса, поэтому дерзай, вдруг ты станешь нашим следующим великим вождем, который поведет всю нашу нацию на новые свершения!

${this.getScores(score_all_time, score_season)}
`;
  }

  static getScores(score_all_time: number, score_season: number) {
    return `<b>Очки альфы за все время</b>: ${score_all_time}
<b>Очки альфы за этот сезон</b>: ${score_season}`;
  }

  static getCardInformation(
    card: Card,
    score_all_time: number,
    score_season: number,
    has_score?: boolean,
  ) {
    const { name, rarity, score } = card;

    return `(тут кастомные эмодзи для каждого rarity) ${name.toUpperCase()}
🐘 Вот твоя карта, братан!
💎 Редкость: <b>${rarity}</b>
💪 <b>+${score}</b> см. челюсти

${has_score ? this.getScores(score_all_time, score_season) : ''}
`;
  }

  static getOnlyCardName(
    card: Card,
    score_all_time: number,
    score_season: number,
    has_score?: boolean,
  ) {
    const { name, rarity, score } = card;
    return `${name.toUpperCase()}
💎 Редкость: <b>${rarity}</b>

${has_score ? this.getScores(score_all_time, score_season) : ''}
`;
  }

  static getWebDescription() {
    return `Мужик, тут ты можешь удобно посмотреть всю свою коллекцию в формате сайта!
Просто жми на кнопку внизу 👇👇👇
`;
  }
}
